#+EMAIL: gray.calhoun@gmail.com
#+AUTHOR: Gray Calhoun

* purpose
** understand the behavior of forecast comparison for overfit models
** graduate with PhD
* principles
** write for at least one hour a day
** version control
** try to write using org mode
* vision
** a decent draft that you can polish up to send to Econometrica
** about a 30-40 page paper
** theoretical section describing your theory and comparing it to others
** theoretical discussion explaining the importance of E_T(D_T'-bar)
** a nice simulation demonstrating that your confidence intervals are the bomb and illustrating the necessity of small R
* Plan
** writing it up
*** so far, nothing specific other than working an hour every day
** theory
*** TODO Hypothesis testing controls conditional probability of choosing larger model given it is worse
**** Need to reread material on conditional probability for possible martingale structure
**** need to work through special examples
*** TODO Positive definiteness
**** I'm not sure whether we need positive definiteness or not
***** read over proof of normality to see if you need positive definiteness
***** if you do, work out a reasonable proof ensuring positive definiteness as long as one model is overfit
** TODO nonconvergence -- don't get an estimate of expected loss (at true betas)
*** give an example demonstrating
*** don't worry about giving a general proof that you can never get it
** TODO simulations
   so the plan here is going to be to simulate data from different
   proposed exchange rate models (with different coefficients) then see
   whether E_T L is "good".  We also want to see the "size" for
   standard in-sample and out-of-sample approaches -- block on the
   model and the coefficients. -- you have a diagram of this in your folder
*** use data-generating processes from exchange rate literature
**** TODO so you need to look in these exchage rate papers and pull out the dgps
**** papers to look at
***** Engel and West _Exchange Rates and Fundamentals_
***** Engel, Mark and West _Exchange Rate Models are not as bad as you think_
      This is kind of a review article for the /handbook of macro/ so
      it should have a good overview of some models
****** comment by Barbara Rossi
******* characterizes the EMW DGP					:DGP:
	$s_t$ is the exchange rate, $f_t$ is the fundamental
	$\Delta f_{t+1} = \rho \Delta f_t + \epsilon^f_{t+1}$,
	$s_{t+1} = -(1/\eta) f_t + (1 - \eta) s_t + \epsilon^e_{t+1}$
	and 
	$(\epsilon_{t+1}^f, \epsilon_{t+1}^e) 
	= \begin{pmatrix} 1 & \sigma_{fe} \\ 0 & 1 \end{pmatrix} (\eta_{t+1}^f, \eta_{t+1}^2)'$
	In EMW, $\sigma_ef =0$
	
	It would be pretty easy to simulate from this, obviously.
******** what else do I need for a dgp?
	 + n
	 + \rho
	 + \eta
	 + the variances of the innovations
****** comment by Kenneth Rogoff
***** Gourinchas and Rey _International Financial Adjustment_
***** Rogoff and Stavrankeva _The continuing puzzle of short hozion exchange rate forecasting_
      This is kind of a critical -- in the sense that it criticizes
      the other papers -- article, so I don't think it gives
      its own models, but it summarizes and criticizes the previous
      few. 
***** Molodtsova and Papell _out of sample exchange rate predictability with taylor rule fundamentals_
      I'm not sure where I pulled this from -- but maybe?  It's
      forthcoming in the Journal of International Economics.
*** draft code
**** simulate data from dgp
**** estimate recursive forecasts from regression models
**** calculate test statistics for each regression model
*** output - do basic contingency table (see sheet)
** When it is done
*** send a working copy out to people for comments
**** Todd Clark
**** Allan Timmermann
**** Yixiao
**** Jim Hamilton
**** Ivana
**** Hal White
**** Graham Elliott
**** Jim Stock?
* Diary
** Work on <2009-03-06 Fri>
*** CLOCK: [2009-03-06 Fri 08:02]--[2009-03-06 Fri 09:21] =>  1:19
*** What did I plan to do?
    I didn't really have a plan.  I wanted to "work" for an hour
    before doing anything else today
*** What did I actually do?
    I poked around the org-mode outline for a bit and mostly worked on
    the "interpretation" section.  I got up a few times and checked my
    email about three times.
*** What did I learn?
    Organizing the paper in an outline is useful, but I still need to
    actually type the damn paper up.  For whatever reason, I'm still
    on a first draft for a lot of this stuff, so I basically need to
    just type the sections accordingly.  There are also strong
    benefits to sitting at the desk and struggling continuously for
    half an hour or so, so I really need to avoid checking email, etc,
    while I'm writing.
*** What am I going to do next?
    Sit down tomorrow and just type some long paragraphs about this
    material.  Don't check email or even get up during the writing
    phase.  Get started pretty early (before 6) so that you can have a
    full day ahead of you.  Of course, that means that you need to go
    to bed early tonight.
** Work on <2009-03-07 Sat>
   CLOCK: [2009-03-07 Sat 07:20]--[2009-03-07 Sat 07:33] =>  0:13
   got disctracted and went online.  Did find out how to do a word
   count in Emacs, though.
   CLOCK: [2009-03-07 Sat 07:34]--[2009-03-07 Sat 09:10] =>  1:36
   WORDS: 7774 to 8449 => 675 wrote
*** What did I plan to do?
    open up the paper outline and type long paragraphs for over an
    hour in the morning; avoid going online or doing anything mentally
    distracting during that stretch.
*** what did I actually do?
    It didn't start out great, as I clocked in and then immediately
    went online to figure out how to do a word count in emacs.  Then I
    went to ESPN for some reason... fortunately, I "checked myself"
    and disconnected after 15 minutes.  I set up the podium at the
    desk and basically typed in the "distribution" section for an hour
    and a half -- introduction, convergence of M(\hat\theta_R) to
    E_R(\bar D_T), and some of the asymptotic normality.  Jess and
    Blair were sleeping the whole time, so I felt pretty able to focus.
*** what did I learn?
    I remembered that I like to type standing up.  I used the outline
    feature to have two different candidate paragraphs for some
    sections and I kind of like that approach.  I think that clocking
    time and word count is going to be helpful.  Writing down ideas as
    I have them and tossing them into the inbox is wonderful.
*** what am I going to do next?
    I'll try this same approach tomorrow --- wake up early, shower,
    make some coffee, and then just try to write down more words.
** Work on <2009-03-08 Sun>
   :CLOCK:
   ended with 8956 words => 507 wrote
   CLOCK: [2009-03-08 Sun 12:59]--[2009-03-08 Sun 14:11] =>  1:12
   going to make some coffee and then go back to work -- scratch that.
   CLOCK: [2009-03-08 Sun 12:23]--[2009-03-08 Sun 12:37] =>  0:14
   started to work and then mom called.
   :END:
*** What did I plan to do?
    planned to wake up early and work in the morning; mostly just
    typing down words in the section that I designated "draft"
*** What did I actually do?
    I spent most of the morning holding Blair -- Jess didn't sleep
    very much so I was trying to stop her from crying -- and watching
    TV. I started to work after lunch, and basically typed on the
    mixingale section with mixed degrees of success.
*** What did I learn?
    a combination of outlining and just typing worked pretty well.  I
    changed the emacs colors to white on black, and set the default to
    be full-screen, and I'm pretty happy with both of those.
*** what am I going to do next?
    I'll try tomorrow to work earlier... first thing if possible.
** Work on <2009-03-10 Tue>
   CLOCK: [2009-03-10 Tue 14:50]--[2009-03-10 Tue 15:23] =>  0:33
** Work on <2009-03-13 Fri>
   :CLOCK:
   CLOCK: [2009-03-13 Fri 15:05]--[2009-03-13 Fri 16:28] =>  1:23
   CLOCK: [2009-03-13 Fri 14:57]--[2009-03-13 Fri 15:03] =>  0:06
   :END:

** Work on <2009-03-14 Sat>
   words: 9383 to 10664 for 1281
   :CLOCK:
   CLOCK: [2009-03-14 Sat 09:25]--[2009-03-14 Sat 09:52] =>  0:27
   CLOCK: [2009-03-14 Sat 08:19]--[2009-03-14 Sat 09:06] =>  0:47
   :END:
*** what did I plan to do?
    Wake up earlyish today and write a bunch of words and paragraphs.
*** what did I actually do?
    got up around 6:30-7, drank some coffee and wrote a bunch while
    listening to the pixies.  I worked mostly on the comparison of 
    my stuff to Clark and West's approach
*** whad did I learn?
    I don't know.  I'm curious if I write more in the morning.  I feel
    pretty good about how much I wrote, and I was just sort of
    bouncing along pounding away at the keyboard feeling pretty good
    about it
*** what will I do next?
    I'll try to wake up early again tomorrow, make some coffee, and
    stand here in my office and type like I just don't care.  I also 
    need to look at the feasibility of doing a correction like
    clark and west's
** Work on <2009-03-16 Mon>
   I'm going to clock some time in my office, but not actually writing
   the paper -- I need to take a step back and do some readin' and
   thinkin.
   CLOCK: [2009-03-16 Mon 15:27]--[2009-03-16 Mon 16:50] =>  1:23
*** what did I plan to do?
    I planned to do some non-writing planning work on this paper, in
    my office.
*** what did I actually do?
    I read a bit on the exchange rate models -- sort of collected my
    thoughts a little on what I need to do.  I have a sketch of a
    DGP.  I must have dicked around some, because I certainly don't
    feel like I've done an hour and a half of work.
*** what did I learn?
    basic Engel & West DGP to use -- I can tweak the DGP to represent
    different fundamentals, but the iterative process is basically the
    same no matter what.
*** what am I going to do next?
    I need to start coding it up -- that part is easy.  I'm going to
    compare (I guess) a random walk model to a VAR so I need code to
    produce the forecasts for both (for various windows).
** Weekly review on <2009-04-08 Wed>
   So, I haven't worked on the project much lately.  I think I need to
   make sure I work for at least half an hour each day on it.
